DO $$
BEGIN

TRUNCATE TABLE  otus."OrderDetails", otus."Orders", otus."Products", otus."Users"  RESTART IDENTITY CASCADE;

-- Первичное заполнение
-- Продукты
INSERT INTO otus."Products"("ProductName", "Description", "Price", "QuantityInStock")
	VALUES 
		('Сахар', 'Рассыпной белый сахар Россия', 50500, 1350.000),
		('Сахар тросниковый', 'Описание тросниковый', 73533.50, 150.000),
		('Сахар рафинированный', 'Описание Сахар рафинированный', 189533.0, 550.567),
		('Соль', 'Описание Соль', 22028.90, 7850.505),
		('Соль морская', 'Описание Соль морская', 933, 4.300),
		('Соль иодированная', 'Описание Соль иодированная', 118637.6, 850.000),
		('Соль каменная', 'Описание Соль каменная', 19021.75, 8950.000),
		('Спички по штучно', 'Описание Спички по штучно', 500, 1500000.000),
		('Спички коробок', 'Описание Спички коробок', 10750.15, 10500.000),
		('Спички охотничии', 'Описание спички охотничии', 150350.00, 555.000);
--select * from otus."Products";

-- Пользователи
INSERT INTO otus."Users"( "UserName", "Email", "RegistrationDate")
	VALUES 
		('Иванов Иван', 'Ivan@mail.ru', '2024-01-25'),
		('Сидоров Семен', 'Sidorov@otus.ru', '2023-12-10'),
		('Петров Петр', 'petrov@rambler.ru', '2024-02-29');
--select * from otus."Users";

-- Заказы
INSERT INTO otus."Orders"("UserID", "OrderDate", "Status")
	VALUES 
		(1, '2024-01-27', 'Получен'),
		(1, '2024-04-15', 'Формируется'),
		(1, '2024-03-17', 'Отменен'),
		(1, '2024-04-10', 'Доставка'),
		(2, '2024-03-12', 'Получен'),
		(3, '2024-03-17', 'Получен'),
		(3, '2024-03-22', 'Отменен'),
		(3, '2024-04-17', 'Доставка')
		;
-- select * from otus."Orders"

-- Детали заказа
INSERT INTO otus."OrderDetails"(
	"OrderID", "ProductID", "Quantity", "TotalCost")
	VALUES 
		(1, 3, 15.5, 1500.5),
		(1, 1, 100.0, 5000.0),
		(1, 9, 100.0, 115.0),
		(2, 10, 2.0, 1150.20),
		(3, 10, 200.0, 115000.00),
		(4, 4, 50.5, 1515.15),
		(5, 4, 50.5, 1515.00),
		(6, 5, 5.5, 400.5),
		(7, 6, 10.10, 1090.11),
		(8, 7, 23.35, 450.50)
		;
-- Select * from otus."OrderDetails";

END;
$$